{
    "items": [
        {
            "id": 1,
            "title": "The Castle of the Dukes",
            "latitude": "51.20904118654189",
            "longitude": "17.376616717185023",
            "address": "Zamkowa 4, \n56-400 Oleśnica",
            "opening-hours": "10:00 - 18:00",
            "phone": "71 314 20 12",
            "description": "The Castle of the Dukes of Oleśnica. It stands on the foundations of a medieval Piast stronghold. Over many centuries, it has been modernized and expanded. Although the castle is little known, it has a very rich history. Initially a medieval stronghold, it later became a Gothic castle and eventually a Renaissance princely residence. Within the walls of the building, we can find the presence of the Piast dynasty, the Podiebrad family, the Württemberg family, the Brunswick family, and the Hohenzollern family. Since 1945, despite the fact that the walls themselves were not damaged during the battles, the castle has slowly deteriorated. Initially occupied by a unit of the Soviet International Red Cross, it then served as a collection point for displaced Germans until mid-1947. From 1950, the castle housed a Construction and Road Engineering Technical School, and until 1965, it was used by various institutions that did not take care of its good condition. Only in 1965, it was decided to carry out conservation work for the benefit of the Polish Scouting Association (ZHP) and the newly established museum.",
            "history": "The Castle in Oleśnica is one of the largest architectural attractions of the city. Over the centuries of its existence, it underwent numerous modifications, some of which are visible to this day. It consists of three parts: the four-winged main castle with an outer courtyard, the palace with the former main entrance gate, and the foregate, known as the barbican.\nIn the 13th century, there was a defensive stronghold on the site of the current castle. After the establishment of the Duchy of Oleśnica, it gradually gained significance. Eventually, it was rebuilt at the initiative of Duke Konrad I, who moved to Oleśnica after 1323. The wooden structures were replaced with stone, creating a representative castle.\nIn the corner of the inner courtyard stands a tall, cylindrical tower. It is perfectly accentuated by being integrated into two wings of the castle. Its structure is Gothic. Built on a circular plan, it has six storeys, with the top one dating back to 1561. A viewing gallery with a stone balustrade was arranged on the top floor. In the corners of the gallery, there are stone figures of lions holding the coat of arms of Silesia, as well as heraldic figures of the Podiebrad family and two plaques with Latin inscriptions, reminding that the tower was extended and decorated with figures by Duke John of Podiebrad. The chimes of the clock placed on the tower play several bars of the European Union anthem - a fragment of Beethoven's 'Ode to Joy'.\nThe castle remained the property of the Hohenzollern family until the end of World War II. After 1945, it was abandoned, and the surviving buildings were used to house Hungarian and Italian prisoners of war. Later, it housed a branch of the Soviet International Red Cross, followed by a Construction Technical School and the Central School of ZHP Zuch Instructors. Finally, in the 1970s, it underwent renovation and became a branch of the Archaeological Museum in Wrocław. Since 1993, it has been the home of the Voluntary Labor Corps."
        },
        {
            "id": 2,
            "title": "The Savior's Church",
            "latitude": "51.2109851591018", 
            "longitude": "17.378624597034243",
            "address": "Łużycka 22, \n56-400 Oleśnica",
            "opening-hours": "10:00 - 18:00",
            "phone": "604 432 628",
            "description": "It likely dates back to the 14th century. Originally a Gothic synagogue built by the Jewish population, possibly originating from Prague. Historians speculate that this population was not large, but certainly wealthy and influential. They most likely had their own district located near the defensive walls, where the synagogue was situated. It is unknown when it was built, but to this day, we can pass through the Jewish Gate (Furta Żydowska) to see the remains of the walls. Currently, a Pentecostal church is located there.",
            "history": "The Savior's Church in Oleśnica, located on the current Łużycka Street, is one of the oldest buildings in Poland that used to serve as a synagogue. The Gothic synagogue in Oleśnica was built in the late 14th century and was first mentioned in documents in 1417. Originally, it was a hall structure with two naves supported by two pillars and six vaulted bays. It consisted of a prayer hall measuring 9.50 meters by 11.80 meters and a small vestibule on the northern side. According to some historians, it was modeled after the Altneu Schule synagogue in Prague, built in 1270. However, due to changes in its use, the interior of the synagogue was altered.\nThe only remnants of the original synagogue layout are the external walls with buttresses, traces of vaults and Gothic windows, as well as an annex on the axis of the eastern wall, which covered a niche. In the 15th century, Chaim Schwarz from Prague (also known as Chaim ben Dawid Sachor), along with his partner Dawid ben Jonathan, established a Jewish printing house, which was likely located in the annex of the synagogue. After 1535, the synagogue served as a municipal warehouse and arsenal. To allow for the entry of cannons, a wide entrance was made in the porch and a similar one in the eastern wall. In 1695, it was taken over by the Lutherans, who converted it into an Evangelical church dedicated to the Savior. This church is currently a branch of the Augsburg Evangelical Parish in Wrocław and the headquarters of the Pentecostal Church."
        },
        {
            "id": 3,
            "title": "Basilica of St. John the Apostle",
            "latitude": "51.20985599604885", 
            "longitude": "17.37814179905812",
            "address": "Łużycka 4, \n56-409 Oleśnica",
            "opening-hours": "",
            "phone": "71 314 21 42",
            "description": "The chronicles indicate the year 979 as the date of the consecration of the first temple in this place. Although this date is likely, it is not confirmed by archaeological research. Since 1230, the temple has served as a castle church. Similar to the castle, the basilica was expanded with the arrival of successive dukes in different eras. As a result, we can find traces of the Piast dynasty, the Podiebrad family, and the Württemberg family, which means that the church combines elements of Gothic, Renaissance, Mannerism, and Baroque styles. The basilica did not undergo significant renovations that would disrupt the ducal building plans. It was also not seriously damaged during the war. However, in 1900, a construction disaster occurred during modernization efforts aimed at installing heating, resulting in the loss of one of the ducal lodges, a balcony for the choir, and the original flooring. Despite the damage, the most valuable monuments have survived to this day, including the Württemberg Mausoleum, one Ducal Lodge, and the Chain Library. Since 2019, the basilica can be visited in its full splendor with a guide thanks to the Kachna Foundation."
        },
        {
            "id": 4,
            "title": "The Wrocław Gate",
            "latitude": "51.21088430581085", 
            "longitude": "17.37667036596505",
            "address": "Wrocławska, \n56-400 Oleśnica",
            "opening-hours": "",
            "phone": "71 314 22 03",
            "description": "A medieval city gate, actually a brick gate tower, originally known as the Trzebnicka Gate. It was likely built between 1325 and 1380, replacing the previous gate in the perimeter of wooden and earthen fortifications. It is the only one of the four gates that has survived to the present day.",
            "history": "Brama Wrocławska, also known as the Wrocław Gate, was adapted to the development of artillery weaponry by modifying the city walls and gates. Around 1532, construction of the outer defensive ring, called the parkan, began. It provided increased resistance to artillery fire and allowed for the placement of cannons between the walls. For unknown reasons, it was only built on a small section near the former Wrocław Gate.\nAn artillery tower (basteja) was constructed during the building of the double section of the walls. It was partially demolished at the end of the Thirty Years' War and later converted into apartments in the 19th century. The basteja was added to the curtain wall near the castle but was also dismantled in a way that made its reuse impossible.\nAt the end of the Thirty Years' War, Swedish General A. Wittenberg ordered the demolition of the fortifications and the filling of the moats, but the extent of the work carried out is unknown.\nBy the early 16th century, the Wrocław Gate tower (formerly known as the Trzebnica Gate) was likely two stories tall. Above the vaulted passage, there was a guard room where the mechanism for raising the gate was located. The tower probably also stored weapons for the guild responsible for defending the gate and the adjacent section of the wall. In front of the tower, above the moat, there was a outer gate. Around 1532, an additional one or two stories were added to the tower. A defensive walkway with battlements was created on top of the final story. It was renovated in 1614 during the reign of Charles II of Poděbrady. After the Thirty Years' War, Duke Sylwiusz Nimrod Württemberg restored the tower in 1652. Another restoration, as a historical monument, took place in 1888. Subsequently, the tower rooms were likely not used as the access to them was difficult.\nBy the mid-18th century, the defensive significance of the walls diminished. Houses and chambers were built alongside them, and vegetable gardens appeared in the moats. The city gates served as control points for people entering the city and collecting tolls. In the 19th century, the walls were not demolished to facilitate the city's expansion because it would have required the demolition of many adjacent houses. In 1868, three out of the four city gates impeding the transportation of goods were dismantled. The Wrocław Gate, however, was spared from demolition, partly due to the opposition of the future Emperor Frederick III during his visit to Oleśnica in 1866.\nFrom 1956 to 1959, the gate underwent renovations, including the addition of a roof, dividing the interior into three functional levels, and the installation of wooden, historically-inspired stairs leading to the remaining entrance. The adjacent walls were also extended, restoring the battlements and a small section of the covered defensive walkway. The ground floor features a pointed arch passage, vaulted with a barrel vault within the tower. Outside, the guides for lowering the gate's grille are still preserved. It is the only remaining tower of the four gate towers that once existed. Currently, the tower's rooms are used for exhibition purposes, and the city walls are continuously maintained."
        },
        {
            "id": 5,
            "title": "Town Hall",
            "latitude": "51.209633858968246", 
            "longitude": "17.379715307425784",
            "address": "Rynek Ratusz, \n56-400 Oleśnica",
            "opening-hours": "",
            "phone": "",
            "description": "It was the house of the bailiff located on the outskirts because the center of the market square was occupied by stalls and benches for traders. After the repurchase of the bailiwick in 1407, in order to give the city council a higher status, the construction of a masonry town hall took place in 1410. It was not located in the axis of symmetry of the market square because it was built on the site of a previous merchant's house. The first reconstruction of the town hall took place in 1535, as a result of damage caused by a severe storm. Another thorough renovation was carried out in 1664, on the order of Sylwiusz Nimrod of Württemberg, as the walls of the building were in danger of collapsing. The town hall was not renovated until 1730 when a major fire broke out in the city, destroying the stalls and the town hall itself. In 1750, the town hall was rebuilt. The building we see today is a reconstruction after being bombed by the Germans in 1945.",
            "history": "The first Town Hall (according to other sources, it was the Mayor's house) was likely made of wood and was mentioned as early as 1393. It was a one-story Gothic-style building. The tower could have been built simultaneously or added after the construction of the Town Hall between 1400-1500.\nBuilt around 1410, it underwent multiple damages and alterations that fundamentally changed its appearance. In 1535, it was seriously damaged by a hurricane.\nIn the 16th century, a text (golden letters) was placed above the main entrance: 'NIHIL EST EX OMNIBUS REBUS HUMANIS PRAECLAR(I)US AUT PREASTAUTLUS QUAM DE REPUBL. BENE MERETI' (Among all human affairs, there is nothing more beautiful or honorable than to serve well the Oleśnica Republic).\nFires in 1730 and 1823 destroyed the Town Hall. It was reconstructed in 1826 in a neoclassical style, and a renovation in 1892 resulted in the merging of two previously separate buildings into one.\nIn 1945, the Town Hall building burned down once again. According to former German residents of the city, the cause was the aerial bombardments in early February, after the city had already been occupied. The staircase survived the war's devastation. The preserved stone coats of arms can be admired on the first and second floors of the Town Hall.\nDuring the reconstruction, the external form of the Town Hall was preserved in a neoclassical outline, but not entirely. The front facade is two-thirds the length of the previous one, which did not deprive it of its former appearance. The remaining part - the former southern section and three adjacent demolished buildings - were intended for a hotel. The ground floor of the northern wing was designated for a bank. The reduction in the necessary volume of the Town Hall probably resulted from the adoption of democratic centralism in 1950, which abolished the autonomy of cities and the number of functions carried out by the Municipal National Council Presidium. The tower's spire was not renovated, hence the visible traces of the war.\nThe interior of the Town Hall, except for the staircase, was completely new and adapted to contemporary needs. It is a two-story, quadrangular structure with partially preserved neoclassical facade division, covered with a hipped roof with an inner skylight. It is the prominent feature of the Market Square, with the tower clearly visible, and it also provides an interesting visual closure to Matejki Street and, at its end, Wrocławska Street.\nIn 2008, a sound system for alarm signaling was installed on the Town Hall tower. In the same year, the roof was renovated, and a flagpole was installed. The Town Hall is currently the seat of the municipal authorities (City Council, City Board, and Mayor)."
        },
        {
            "id": 6,
            "title": "The Holy Trinity Church",
            "latitude": "51.21106567736473", 
            "longitude": "17.379354076651204",
            "address": "Łużycka 4, \n56-400 Oleśnica",
            "opening-hours": "",
            "phone": "71 798 21 00",
            "description": "The youngest Baroque monument in the city, dating back to 1744. There was once a cemetery near the church, and the most distinguished individuals involved in its establishment and expansion were buried within its walls. At that time, it was the only Catholic church in the city. The majority of the residents, under the influence of the Württemberg family and previously the Podiebrad family, had embraced the Protestant faith. However, the establishment of the church was not related, as it might seem, to the Counter-Reformation or the vigorous promotion of Catholicism by the Jesuits. It all began in 1720 when a Catholic military garrison of the Austrian emperor appeared in Oleśnica. The army had its own chaplain, which was utilized by the few Catholics residing in the city. Around 100 people attended religious services with the military. Even when the garrison was withdrawn in 1727, a small group of Catholics began to strive for the establishment of their own chapel and later a church. The task was not easy due to the reluctance of the Protestant rulers residing in the castle. However, in 1738, the inhabitants received permission to build a church from Vienna. The construction took many years, but the first service was held in the still unfinished church in 1744. The construction work continued until around 1798 when a porch was added to the east side. Unfortunately, the church was destroyed in 1945. The frescoes covering the walls, the Baroque sculptures, and the entire interior furnishings were lost forever. The church was only rebuilt in 1961."
        },
        {
            "id": 7,
            "title": "The Orthodox Church of St. George",
            "latitude": "51.21187466982983", 
            "longitude": "17.38139905662975",
            "address": "Łużycka 20, \n56-409 Oleśnica",
            "opening-hours": "",
            "phone": "",
            "description": "The intersection of Matejko, Łużycka, and Kościelna streets is one of the oldest sacred sites in Oleśnica. The two connected churches, dedicated to the Virgin Mary and St. George, are among the most interesting examples of church architecture in Poland. They were built in the second half of the 13th century, possibly no later than its end. The history of the churches is closely related to places that, unfortunately, did not survive to this day. And it all began with the establishment of the St. George Hospital (shelter). The exact date of its foundation is unknown, but we know that by 1340, the hospital had gained fame, a good reputation, and consequently, many assets that allowed it to sustain itself. In 1340, at the request of Duke Konrad I, the hospital was incorporated by the Bishop of Wrocław into the sub-Oleśnica prebend of the regular canons of St. Augustine, who were located outside the city walls until the 14th century. The canons were responsible for the St. George Hospital and the small adjacent church.",
            "history": "The Church of the Nativity of the Most Holy Mother of God and St. George is one of the more interesting monuments of church architecture in Poland. In the early days of its existence, until 1505, there were two separate Gothic monastic churches standing side by side with a shared wall.\nThe first one, dedicated to St. George, was built in the second half of the 14th century and belonged to the Regular Canons of St. Augustine. The second one, dedicated to the Body of Christ, was added after 1380 to the Church of St. George and belonged to the Slavic rite Benedictines, also known as the 'Slavic brothers'. It is believed that the Benedictine church was intended for Polish residents of Oleśnica. Around 1400, a church tower was added to the Benedictine church, which also served a defensive purpose (it stood next to the city wall).\nIn 1505, the church (and the monastery) were joined by demolishing the shared wall, and the altar was placed on the north wall of the Church of St. George. After the introduction of Protestantism in Oleśnica in 1538, the Augustinian monks left the monastery, which was turned into a shelter for the poor. The church, after 1555, became a Protestant church dedicated to the Nativity of the Blessed Virgin Mary and St. George. During the time of Duke Karol II of Poděbrady (1609), the church was renovated and expanded by adding a porch. It is possible that a ducal lodge, galleries, and a choir loft were built at that time. In 1703, Duke Christian Ulrich of Württemberg founded an altar pulpit and a ducal lodge. In the 17th and 18th centuries, the former monastery buildings next to the churches were demolished.\nFrom the 16th century until around 1780 (other dates are also mentioned), Protestant services for Poles were held in this church. Sermons were delivered by, among others, Jerzy Bock, a Polish pastor in Oleśnica, the archdeacon of Oleśnica, a poet who wrote in Polish, translator, and promoter of the Polish language. After his death in 1690, he was buried within the Church of the Blessed Virgin Mary, and his tombstone still existed there until 1936. Around 1850, the church became a garrison church, and in 1933, it underwent extensive renovation. In January 1945, it burned down along with all its furnishings, wooden Gothic figures, galleries, lodge, organ, and epitaphs. Only the tower remained, heavily damaged.\nFrom 1966 to 1970, commissioned by the City Council, new roofs were built, walls were restored, and the tower was renovated. This ensured the preservation of the monument and eliminated one of the many post-war ruins of the city. The churches were separated by a wall once again. The former Church of the Blessed Virgin Mary has been serving Orthodox believers since 1968. It is now an Orthodox church dedicated to the Dormition of the Most Holy Mother of God.\nIn 2001, the City Council of Oleśnica commissioned a partial renovation of the unused Church of St. George. The roof was repaired and the gaps in the brick walls were filled. Specially fired bricks, similar to the Gothic ones used in the original construction of the church, were used for the restoration."
        },
        {
            "id": 8,
            "title": "Water Tower",
            "latitude": "51.21421513935061", 
            "longitude": "17.392757820974648",
            "address": "Wojska Polskiego 57, \n56-400 Oleśnica",
            "opening-hours": "",
            "phone": "",
            "description": "The neo-Gothic water tower, along with the waterworks facility, was built between 1896 and 1898 according to the design of Royal Construction Advisor Engineer Adolf Thieme from Leipzig. The Oleśnica waterworks consisted of water intakes, a waterworks facility, a water tower, and a pipeline system. In 1930, the water supply network was approximately 20 meters long. This was the first renovation of its kind since 1600. The historic elements of the old Podiebradowski pipeline – pumps, wooden measuring devices, and pipes – are said to be located in the old waterworks facility. Unfortunately, this place is not accessible to history enthusiasts."
        },
        {
            "id": 9,
            "title": "City Walls",
            "latitude": "51.21170754284372", 
            "longitude": "17.379712116834934",
            "address": "Rzemieślnicza 4, \n56-400 Oleśnica",
            "opening-hours": "",
            "phone": "",
            "description": "Medieval city walls, almost fully preserved, showcasing the outline of the stronghold of the Piast dynasty in Oleśnica."
        },
        {
            "id": 10,
            "title": "Chain Library",
            "latitude": "51.20978294335201", 
            "longitude": "17.378114048893483",
            "address": "Łużycka 4, \n56-409 Oleśnica",
            "opening-hours": "",
            "phone": "",
            "description": "The parish church dedicated to St. John the Evangelist houses a collection of ancient prints originating from the church library founded in 1594 by Duke Karol II of Ziębice-Oleśnica from the Czech Poděbrady family. The books were originally part of the princely collection at the castle, and from 1594 to 1619, the collection was supplemented with donations and expanded through the generosity of the residents. The organization of the library was overseen by Pastor Melchior Eccard, the superintendent of the Duchy of Oleśnica. It was located in the castle church above the main entrance, with books placed on two shelves along the walls. A table was positioned between them for the readers.\nThe library had a public character, and to protect it from theft, the books were secured with chains. Large-format books were attached to chains one Silesian ell long (60.3 cm), while smaller-format books were secured with shorter and more delicate chains. At the end of the chains were rings that were fastened to a rod above the table for users. The library was intended to serve the local clergy, teachers, gymnasium students, and interested residents of the town. The collection focused on theological and religious topics.\nThe school rector was responsible for the library's care. In the early 19th century, the collection consisted of about 400 volumes, and by the early 20th century, it had approximately 350 volumes. Chains have survived with 52 volumes, and other books show traces of chain attachments. Among the books, there is one of the first editions of the German translation of Władysław Reymont's 'The Peasants' ('Chłopi'). The majority of the books were prints from the 16th and 17th centuries, primarily on theological subjects.",
            "history": "The room has an area of ​just under 15. All volumes were acquired through donations from wealthy residents of Oleśnica, including the prince himself. The number of volumes never exceeded 550. Currently, there are 239. The library was fortunate in its history. In 1905, during the renovation and expansion of the church, the entire main nave collapsed, but the book collection remained unharmed. In 1945, Soviet troops started a fire that destroyed over 90% of the buildings in Oleśnica. One of the few surviving buildings was the church, and within it, the library. It was only in the late 1990s that a very costly and laborious operation to restore the book collection could be carried out. One interesting aspect is that some of the old evangelical prints were bound in medieval parchment with old Catholic handwritten liturgical texts and Hebrew apocrypha."
        },
        {
            "id": 11,
            "title": "Court",
            "latitude": "51.206064684009206", 
            "longitude": "17.379314103477313",
            "address": "3 Maja 48/49, \n56-400 Oleśnica",
            "opening-hours": "7:30 - 15:30",
            "phone": "717566301",
            "description": "",
            "history": "Karl Friedrich Endell is the author of the design for the Land Court building in Oleśnica (also the author of the current building of the National Museum in Wrocław). K.F. Endell was also listed as the author of court and prison buildings in other cities. They were built in the 1880s.\nFrom the given information, it can be inferred that the design of the court building began before Endell's death in 1891, the overall view was completed in 1894, and the project was finished in 1896. The court was already shown on a postcard from 1897. Such a building was typically constructed within several to several dozen months.\nThe underground tunnel of the court was reportedly still passable in the 1950s and was supposedly described in interwar literature (prisoner's memoirs). During renovation works in the court building, no passage was found, and there were no traces indicating that any opening had been bricked up before. The plans of both buildings also do not confirm this.\nThe circular feature in the court courtyard is a deep well that used to supply water to the court building. The well is currently covered with a new surface, but the access hatch remains, allowing a peek inside.\nSome of the courtrooms were heated by hot air blown from a furnace, which still exists and is located in the basement (partly obstructed by archive shelves) and 'delights the eyes of those interested in such things.'"
        },
        {
            "id": 12,
            "title": "Prison",
            "latitude": "51.20657805844219", 
            "longitude": "17.377969330674357",
            "address": "Wały Jagiellońskie 1, \n56-400 Oleśnica",
            "opening-hours": "24/7",
            "phone": "713980700",
            "description": "The county prison could have been established after 1741 when Oleśnica became a county town. Alternatively, it could have happened after the 1815-1816 reorganization of the county. The prison in Oleśnica was mentioned in 1860. In 1866, the prison inspector Pflanz was mentioned. In 1881, an individual who had murdered two women and a child was executed by beheading in Oleśnica (probably in the prison, as public executions were discontinued after 1808). In 1895, another unfortunate individual was beheaded with an axe in the courtyard of the Oleśnica prison for drowning his wife. Additional executions by beheading took place in 1896 and 1897 (information about the beheadings was provided by D. Wojtucki).\nDuring its operation, the prison building underwent modernization and expansion, with two additions added to form a 'Y' shape, allegedly providing better security conditions. In 1896, a plan for the modernization of the prison was created. The architect Karl Friedrich Endell, known for his work on the Oleśnica prison (and district court) as well as many others in Silesia and Germany, was the author of the project. The prison resembled the image below, without the two left additions, until around 1899 when they were added.\nIt can be argued that the main prison building was constructed between 1870-1882 and was modernized in 1899-1900. The exact dates were likely reported in the Oleśnica newspapers of that time. Earlier, the prison was probably located between the current M. Skłodowska and J. Sinapius streets, where the District Court was previously situated. The prison was often located next to the court or was a part of it.\nThe view from the south shows three buildings, possibly built in different periods. The post-war reconstruction slightly changed the appearance of the buildings compared to the pre-war period. The elongated northern wing is the oldest prison building, with storage rooms located in the basement. The bathhouse is located along the western prison wall. The Penal Institution was revived on September 7, 1963, after various restructuring processes and continues to exist today.\nIt is unknown when the court prison became a regular detention center. The detention center (Haftanstalt), as it was classified during World War II, had a capacity of 190 places (including 20 for women), and the chief inspector from 1939 to 1945 was Becker. The detention center was intended for men and women sentenced to various terms of arrest and imprisonment from the districts of the regional courts in Oleśnica and Wrocław. From April 1, 1940, to November 11, 1940, a total of 394 individuals were admitted to the prison, and from April 1, 1944, to January 4, 1945, a total of 563 individuals were admitted. Among the individuals in the prison were also women under investigation from the 'Night and Fog' operation (isolation of individuals who could pose a threat to the security of the Reich after the attack on the USSR). The prison was evacuated in January 1945."
        },
        {
            "id": 13,
            "title": "Oleśnica Swimming Pool",
            "latitude": "51.216974700290855", 
            "longitude": "17.39026807693574",
            "address": "Brzozowa 7, \n56-400 Oleśnica",
            "opening-hours": "6:00 - 22:00",
            "phone": "717823972",
            "description": "Swimming is a popular sport and recreational activity that is gaining more and more followers. It has a tremendously positive impact on human health. Not only does it improve overall physical fitness, but it also has a positive effect on the spine. For many, it is also a great way to have fun and enjoy their time.\nThe indoor swimming pool in the Oleśnica Recreation Complex ATOL allows people to enjoy the water all year round, regardless of the weather outside. It is a suitable option for both hot summer days and long, freezing winter evenings.\nTo ensure the safety of guests, there is a qualified lifeguard team overseeing the pool. For those who would like to learn how to swim or improve their existing skills, there is an opportunity to take swimming lessons with an instructor.\nThe swimming facility includes several pools. The sports pool has 6 lanes and measures 25 meters in length. The depth of this pool ranges from 1.35 to 1.80 meters, and it is designed for various water sports.\nFor those interested in relaxation, the recreational pool offers various forms of water massage or a jacuzzi, where air bubbles and warm water (around 35°C) allow you to unwind after a stressful day.\nA popular attraction for both younger and older visitors is the wild river, with its strong current that allows you to test your skills and provides an exhilarating ride for those who let themselves be carried away by the flow. The youngest residents of Oleśnica can safely have fun in the paddling pool with an imitation waterfall. The water in this pool is only 30 cm deep, and its temperature ensures a comfortable playtime.\nIn addition to that, the swimming pool area also features slides of varying degrees of inclination and a sauna complex consisting of two Finnish saunas, a steam sauna, a cold-water pool, and loungers. \nThe Oleśnica swimming pool is open seven days a week from 6:00 am to 10:00 pm, so everyone can find a suitable time to visit. You can come to the pool alone or with friends and family. In any case, spending active time there will allow you to recharge and gain new energy. In addition to the aforementioned indoor water park, a modern outdoor pool was opened in 2010. It includes a swimming area, a recreational area, a paddling pool, a playground for children, a beach volleyball court, and an ice rink that can also function as a tennis court. Soon, a fitness center and squash courts will also be added to the facility."
        }
    ]
}